#language: ru

@tree

Функционал: возможность добавления файла картинки в форме элемента справочника Товар

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: <описание сценария>

И я закрываю все окна клиентского приложения

И В командном интерфейсе я выбираю "Справочники" "Номенклатура"
И в таблице 'List' я активизирую поле с именем 'ItemType'
И я нажимаю на кнопку с именем 'FormCreate'
И в поле с именем 'Description_en' я ввожу текст "1"
И я нажимаю кнопку выбора у поля с именем 'ItemType'
И в таблице 'List' я перехожу к строке:
	| "Код" | "Наименование"               | "Ссылка"                     |
	| "1"   | "Товар (есть размер и цвет)" | "Товар (есть размер и цвет)" |
И в таблице 'List' я активизирую поле с именем 'Description'
И в таблице 'List' я выбираю текущую строку
И я нажимаю кнопку выбора у поля с именем 'Unit'
И в таблице 'List' я выбираю текущую строку
И я нажимаю на кнопку с именем 'FormWrite'
И я выбираю файл 'C:\Users\esolomenko001\Desktop\itempicture1.png'
И я нажимаю на кнопку с именем 'FormWriteAndClose'
И я жду закрытия окна "* (Номенклатура)" в течение 20 секунд

И в таблице 'List' я активизирую поле с именем 'Description'


