#language: ru



Функционал: создание документа Заказ (Продажи)

Как Менеджер по продажам я хочу
создать документ Заказ (Продажи) 
чтобы    

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: создание документа Заказ (Продажи), при добавлении Услуги ввести в поле Количество значение 

И я закрываю все окна клиентского приложения
* Создание документа
	И В командном интерфейсе я выбираю "Продажи" "Заказы"
	Тогда открылось окно "Заказы товаров"
	И я нажимаю на кнопку с именем 'ФормаСоздать'
	Тогда открылось окно "Заказ (создание)"
	И из выпадающего списка с именем 'Организация' я выбираю точное значение 'ООО "Все для дома"'
	И из выпадающего списка с именем 'Покупатель' я выбираю точное значение "Мосхлеб ОАО"
	И из выпадающего списка с именем 'Склад' я выбираю точное значение "Малый"
	И из выпадающего списка с именем 'Валюта' я выбираю точное значение "Рубли"
	И в таблице 'Товары' я нажимаю на кнопку с именем 'ТоварыДобавить'
	И в таблице 'Товары' я нажимаю кнопку выбора у реквизита с именем 'ТоварыТовар'
	Тогда открылось окно "Товары"
	И в таблице 'Список' я перехожу к строке:
		| "Код"       | "Наименование" |
		| "000000036" | "Услуги"       |
	И в таблице 'Список' я выбираю текущую строку
	И в таблице 'Список' я выбираю текущую строку
	Тогда открылось окно "Заказ (создание) *"
	И в таблице 'Товары' я завершаю редактирование строки
	И в таблице 'Товары' я активизирую поле с именем 'ТоварыКоличество'
* Пробуем ввести в поле Количество значение
	И в таблице 'Товары' в поле с именем 'ТоварыКоличество' я ввожу текст "10,00"
И в таблице 'Товары' я активизирую дополнение формы с именем 'ТоварыСтрокаПоиска'
И в таблице 'Товары' я активизирую дополнение формы с именем 'ТоварыСтрокаПоиска'
И в таблице 'Товары' в дополнение формы с именем 'ТоварыСтрокаПоиска' я ввожу текст ""
И в таблице 'Товары' я активизирую поле с именем 'ТоварыТовар'
И в таблице 'Товары' я активизирую поле с именем 'ТоварыКоличество'
И я нажимаю на кнопку с именем 'ФормаЗаписать'
