#language: ru

@tree

Функционал: <описание фичи>

Как <Роль> я хочу
<описание функционала> 
чтобы <бизнес-эффект>   

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: <описание сценария>

И я закрываю все окна клиентского приложения

И В командном интерфейсе я выбираю "Отчеты" "D4010 Остатки товара на складах"
Тогда открылось окно "D4010 Остатки товара на складах"
И я нажимаю на кнопку с именем 'FormGenerate'

Дано Табличный документ "Result" равен макету "макет отчета Остатки"