#language: ru

@tree

Функционал: проверка расчета поля Количество (итог) документа Заказ


Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: проверка расчета поля Количество (итог) документа Заказ

И я закрываю все окна клиентского приложения

* Обращение к экспортному сценарию
	И заполнение шапки документа Заказ

* Заполнение табличной части
	Когда открылось окно "Заказ (создание) *"
	И в таблице 'Товары' я нажимаю на кнопку с именем 'ТоварыДобавить'
	И в таблице 'Товары' из выпадающего списка с именем 'ТоварыТовар' я выбираю точное значение "Торт "
	И я перехожу к следующему реквизиту
	И в таблице 'Товары' я активизирую поле с именем 'ТоварыКоличество'
	И в таблице 'Товары' в поле с именем 'ТоварыКоличество' я ввожу текст "5"
	И в таблице 'Товары' я завершаю редактирование строки
	И я нажимаю на кнопку с именем 'ФормаЗаписать'
* Проверка расчета поля Количество
	Тогда таблица 'Товары' стала равной:
		| 'Количество' |
		| '5'          |
	
		