#language: ru

@tree

Функционал: проверка отображение возвратов в отчете D2001 Продажи

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: проверка отображение возвратов в отчете D2001 Продажи

И я закрываю все окна клиентского приложения

И В командном интерфейсе я выбираю "Отчеты" "D2001 Продажи"
Тогда открылось окно "D2001 Продажи"
И я нажимаю на кнопку с именем 'FormGenerate'

Дано Табличный документ "Result" равен макету "макет документа Продажи"


