#language: ru

@tree

Функционал: <описание фичи>

Как <Роль> я хочу
<описание функционала> 
чтобы <бизнес-эффект>   

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: 2 задание

//В тесте для документа Заказ покупателя необходимо прописатьусловие по заполнению поля Организация. 
//В случае, если поле Организация не заполнилось из соглашения, необходимо его заполнить с помощью шагов в тесте.

И я закрываю все окна клиентского приложения

* Создание док и заполнение поля Соглашения
	И В командном интерфейсе я выбираю "Продажи" "Заказы покупателей"
	И я нажимаю на кнопку с именем 'FormCreate'
	И я нажимаю кнопку выбора у поля с именем 'Agreement'
	И в таблице 'List' я активизирую поле с именем 'Description'
	И в таблице 'List' я выбираю текущую строку
	И в таблице 'ItemList' я активизирую поле с именем 'ItemListLineNumber'
* Условие
	Если поле с именем 'Agreement' заполнено Тогда
		И поле с именем "Company" заполнено 
	И я нажимаю кнопку выбора у поля с именем "Company"
	Тогда открылось окно 'Организации'
	И в таблице "List" я выбираю текущую строку

